In [1]:
import pandas as pd
import dateutil

In [2]:
data = pd.DataFrame({'make':['Toyota','BMW','Toyota','Tesla','Tesla','Tesla'], 'year': ['2018', '2019', '2017', '2016', '2015', '2010']})

In [3]:
data

     make  year
0  Toyota  2018
1     BMW  2019
2  Toyota  2017
3   Tesla  2016
4   Tesla  2015
5   Tesla  2010

In [4]:
groups = data.groupby('make')

In [5]:
groups #this data is not a series or a dataframe, but an object that cannot be displayed

In [6]:
#use aggregate functions on groupby objects 
#sum, average, min, max, count, first, last,

In [7]:
groups.count()

        year
make
BMW        1
Tesla      3
Toyota     2

In [8]:
#load data from the csv file
data = pd.read_csv('phone_data.csv')

In [9]:
data.head()

   index            date  duration  item    month   network network_type
0      0  15/10/14 06:58    34.429  data  2014-11      data         data
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile

In [10]:
data.dtypes #only float or int can be numbers.  the rest are strings.

index             int64
date             object
duration        float64
item             object
month            object
network          object
network_type     object
dtype: object

In [11]:
#Convert date from string to date times.  this is useful if you have to compare your dates
data['date'] = data['date'].apply(dateutil.parser.parse, dayfirst=True) #this is python's way to pass a function into a function

In [12]:
data.head(10)

   index                date  duration  item    month    network network_type
0      0 2014-10-15 06:58:00    34.429  data  2014-11       data         data
1      1 2014-10-15 06:58:00    13.000  call  2014-11   Vodafone       mobile
2      2 2014-10-15 14:46:00    23.000  call  2014-11     Meteor       mobile
3      3 2014-10-15 14:48:00     4.000  call  2014-11      Tesco       mobile
4      4 2014-10-15 17:27:00     4.000  call  2014-11      Tesco       mobile
5      5 2014-10-15 18:55:00     4.000  call  2014-11      Tesco       mobile
6      6 2014-10-16 06:58:00    34.429  data  2014-11       data         data
7      7 2014-10-16 15:01:00   602.000  call  2014-11      Three       mobile
8      8 2014-10-16 15:12:00  1050.000  call  2014-11      Three       mobile
9      9 2014-10-16 15:30:00    19.000  call  2014-11  voicemail    voicemail

In [13]:
data.dtypes

index                    int64
date            datetime64[ns]
duration               float64
item                    object
month                   object
network                 object
network_type            object
dtype: object

In [14]:
data.shape #how many rows in the dataset

(830, 7)

In [15]:
data['item'].value_counts() #what was the longest phone call / data entry?

call    388
sms     292
data    150
Name: item, dtype: int64

In [16]:
item_calls = data[data['item'] == 'call'] #what was the longest phone call / data entry?
item_calls['duration'].max()

10528.0

In [17]:
data[data['item'] == 'call']['duration'].max()

10528.0

In [18]:
item_calls['duration'].sum() #How many seconds of phone calls are recorded in total?

92321.0

In [19]:
#How many entries are there for each month?
data['month'].value_counts()

2014-11    230
2015-01    205
2014-12    157
2015-02    137
2015-03    101
Name: month, dtype: int64

In [20]:
data['network'].nunique() #number of non-null unique network entries

9

In [31]:
data.groupby('month').count()[['item', 'network']] #how many entries per month using groupby

         item  network
month
2014-11   230      230
2014-12   157      157
2015-01   205      205
2015-02   137      137
2015-03   101      101

In [22]:
data.groupby('month').first() #get the first entry for each month

         index                date  duration  item   network network_type
month
2014-11      0 2014-10-15 06:58:00    34.429  data      data         data
2014-12    228 2014-11-13 06:58:00    34.429  data      data         data
2015-01    381 2014-12-13 06:58:00    34.429  data      data         data
2015-02    577 2015-01-13 06:58:00    34.429  data      data         data
2015-03    729 2015-02-12 20:15:00    69.000  call  landline     landline

In [23]:
data.groupby('month').head(1)

     index                date  duration  item    month   network network_type
0        0 2014-10-15 06:58:00    34.429  data  2014-11      data         data
228    228 2014-11-13 06:58:00    34.429  data  2014-12      data         data
381    381 2014-12-13 06:58:00    34.429  data  2015-01      data         data
577    577 2015-01-13 06:58:00    34.429  data  2015-02      data         data
729    729 2015-02-12 20:15:00    69.000  call  2015-03  landline     landline

In [24]:
data.groupby('month')[['duration']].sum() #get the sum of the durations per month

          duration
month
2014-11  26639.441
2014-12  14641.870
2015-01  18223.299
2015-02  15522.299
2015-03  22750.441

In [25]:
data.groupby('month')['date'].count() #get the number of dates / entries in each month

month
2014-11    230
2014-12    157
2015-01    205
2015-02    137
2015-03    101
Name: date, dtype: int64

In [26]:
data[data['item'] == 'call'].groupby('network')['duration'].sum() #what is the sum of durations, for calls only, to each network

network
Meteor        7200.0
Tesco        13828.0
Three        36464.0
Vodafone     14621.0
landline     18433.0
voicemail     1775.0
Name: duration, dtype: float64

In [27]:
data[data['item'] == 'call'].groupby('month')['duration'].sum() #sum only calls of this month

month
2014-11    25547.0
2014-12    13561.0
2015-01    17070.0
2015-02    14416.0
2015-03    21727.0
Name: duration, dtype: float64

In [28]:
data[data['item'] == 'call'].groupby(['month','network'])['duration'].sum()  #what is the sum of durations, for calls only, to each network

month    network
2014-11  Meteor        1521.0
         Tesco         4045.0
         Three        12458.0
         Vodafone      4316.0
         landline      2906.0
         voicemail      301.0
2014-12  Meteor        2010.0
         Tesco         1819.0
         Three         6316.0
         Vodafone      1302.0
         landline      1424.0
         voicemail      690.0
2015-01  Meteor        2207.0
         Tesco         2904.0
         Three         6445.0
         Vodafone      3626.0
         landline      1603.0
         voicemail      285.0
2015-02  Meteor        1188.0
         Tesco         4087.0
         Three         6279.0
         Vodafone      1864.0
         landline       730.0
         voicemail      268.0
2015-03  Meteor         274.0
         Tesco          973.0
         Three         4966.0
         Vodafone      3513.0
         landline     11770.0
         voicemail      231.0
Name: duration, dtype: float64